homework1

console.log('number'+3+3) // при спробі додати до строки числа відбувеється конкатенація. Результатом перетворення буде string - "number33"

console.log(null + 3) // null вказує на відсутність значення, порожність. JS намагається все привести до числа, в цьому випадку null буде дорівнювати 0. Результатом перетворення буде number - 3

console.log(5 && 'qwerty')

console.log(+'40' + +'2' + 'hillel') // унарний + буде перетворювати string у number, тобто +'40' буде дорівнювати 40. Спочатку виконається операція додавання чисел 40+2, а потім додавання числа до рядка. Результатом перетворення буде string - 42hillel

console.log('10' - 5 === 6) // === строга рівність враховує типи данних при порівнянні. Спочатку буде виконуватись віднімання у лівій частині, результатом буде number 5. Після чого буде відбуватись порівняння. Результатом перетворення буде boolean - false

console.log(true + false) // JS намагається все привести до числа, в цьому випадку true = 1, а false = 0. Результатом перетворення буде number - 1

console.log('4px' - 3) // JS намагається все привести до числа, в цьому випадку '4px' не є числом. Тому в результаті перетворення отримуємо NaN

console.log('4' - 3) // Спочатку відбувається перетворення строки "4" на число 4, після чого відбувається операція віднімання. Результатом перетворення буде number - 1

console.log('6'+3**0) // Спочатку відбувається операція піднесення у ступінь - результатом буде 1. Після чтого відбувається злиття рядку та числа. Результатом перетворення буде string - 61

console.log(12/'6') // // Спочатку відбувається перетворення строки "6" на число 6, після чого відбувається операція ділення. Результатом перетворення буде number - 2

console.log('10'+(5===6)) // Спочатку відбувається порівняння у дужках, результатом якого буде boolean - false. Після чтого відбувається злиття рядку та boolean. Результатом перетворення буде string - 10false

console.log(null=='') // Наведенні операнди повертають значення false. Результатом перетворення буде boolean - false

console.log(3**(9/3)) // Спочатку відбувається ділення у дужках, потім піднесення у ступінь. Результатом перетворення буде number 27

console.log(!!'false'==!!'true') // !! - логічне "не". Спочатку відбувається перетворення !!'false' = true, та !!'true' = true. Після чого відбувається порівняння. Результатом перетворення буде boolean - true

console.log(0 || '0' && 1)

console.log((+null == false) < 1) // Спочатку відбувається дія рівності у дужках, після чого відбувається порівняння. Результатом перетворення буде boolean - false

console.log(false && true || true)

console.log(false && (false||true))

console.log((+null == false)<1**5) // Спочатку відбувається дія рівності у дужках, потім відбувається піднесення у ступінь. Після чого відбувається порівняння. Результатом перетворення буде boolean - false